namespace dnd_character_sheet
{
    public static class MenusCollection
    {
        public static string[] mainMenu = new string[]
        {
            "Создание листа",
            "Загрузить лист",
            "Вывести информацию о текущем листе персонажа",
            "Свободные броски кубика",
            "Работа с листом",
            "Сохранить текущий лист",
            "Выход"
        };

        public static string[] DNDEditions = new string[]
        {
            "DND5E"
        };

        public static string[] DND5eRaces = new string[]
        {
            "Гном",
            "Дварф",
            "Драконорожденный",
            "Полуорк",
            "Полурослик",
            "Полуэльф",
            "Тифлинг",
            "Человек",
            "Эльф"
        };

        public static string[] DND5eClasses = new string[]
        {
            "Бард",
            "Варвар",
            "Воин",
            "Волщебник",
            "Друид",
            "Жрец",
            "Чародей",
            "Колдун",
            "Монах",
            "Паладин",
            "Плут",
            "Следопыт"
        };

        public static string[] DND5eSkills = new string[]
        {
            "Акробатика",
            "Анализ",
            "Атлетика",
            "Внимательсность",
            "Выживание",
            "Выступление",
            "Запугивание",
            "История",
            "Ловкость рук",
            "Магия",
            "Медицина",
            "Обман",
            "Природа",
            "Проницательность",
            "Религия",
            "Скрытность",
            "Убеждение",
            "Уход за животными"
        };

        public static string[] YesNo = new string[]
        {
            "Да",
            "Нет"
        };

        public static string[] DND5eProfWeaponGroups = new string[]
        {
            "Простое рукопашное оружие",
            "Простое дальнобойное оружие",
            "Воинское рукопашное оружие",
            "Воинское дальнобойное оружие"
        };

        public static string[] DND5eWeapons = new string[]
        {
            "Боевой посох",
            "Булава",
            "Дубинка",
            "Кинжал",
            "Копьё",
            "Лёгкий молот",
            "Метательное копьё",
            "Палица",
            "Ручной топор",
            "Серп",
            "Арбалет, лёгкий",
            "Дротик",
            "Короткий лук",
            "Праща",
            "Алебарда",
            "Боевая кирка",
            "Боевой молот",
            "Боевой топор",
            "Глефа",
            "Двуручный меч",
            "Длинное копьё",
            "Длинный меч",
            "Кнут",
            "Короткий меч",
            "Молот",
            "Моргенштерн",
            "Пика",
            "Рапира",
            "Секира",
            "Скимитар",
            "Трезубец",
            "Цеп",
            "Арбалет, ручной",
            "Арбалет, тяжёлый",
            "Длинный лук",
            "Духовая трубка",
            "Сеть"
        };

        public static string[] DND5eProfArmor = new string[]
        {
            "Лёгкий доспех",
            "Средний доспех",
            "Тяжёлый доспех",
            "Щит"
        };

        public static string[] DND5eProfInstruments = new string[]
        {
            "Воровские инструменты",
            "Инструменты навигатора",
            "Инструменты отравителя",
            "Инструменты алхимика",
            "Инструменты гончара",
            "Инструменты жестянщика",
            "Инструменты каллиграфа",
            "Инструменты каменщика",
            "Инструменты картографа",
            "Инструменты кожевника",
            "Инструменты кузнеца",
            "Инструменты пивовара",
            "Инструменты плотника",
            "Инструменты повара",
            "Инструменты резчика по дереву",
            "Инструменты сапожника",
            "Инструменты стеклодува",
            "Инструменты ткача",
            "Инструменты художника",
            "Инструменты ювелира",
            "Набор для грима",
            "Набор для фальсификации",
            "Набор травника"
        };

        public static string[] DND5eProfMusicalInstruments = new string[]
        {
            "Барабан",
            "Виола",
            "Волынка",
            "Лира",
            "Лютня",
            "Рожок",
            "Свирель",
            "Флейта",
            "Цимбалы",
            "Шалмей"
        };

        public static string[] DND5eProfGamingSets = new string[]
        {
            "Драконьи шахматы",
            "Карты",
            "Кости",
            "Ставка трех драконов"
        };

        public static string[] DND5eAbilities = new string[]
        {
            "Сила",
            "Ловкость",
            "Телосложение",
            "Интеллект",
            "Мудрость",
            "Харизма"
        };

        public static string[] DND5ePersonalities = new string[]
        {
            "Предыстория",
            "Мировоззрение",
            "Черты характера",
            "Идеалы",
            "Привязанности",
            "Слабости",
            "Возраст",
            "Рост",
            "Вес",
            "Кожа",
            "Глаза",
            "Причёска"
        };
    }
}